In [1]:
s = """Amsterdam  
Utrecht
Den Haag 
Immingham 
Doncaster
Hoek van Holland 
Felixstowe 
Ipswich 
Colchester 
London 
Rotterdam
Gouda"""
ids = [_.strip() for _ in s.split("\n")]

In [2]:
s = """52.379189
52.092876 
52.078663 
53.61239 
53.52285 
51.9775 
51.96375 
52.05917 
51.88921 
51.509865 
51.9225 
52.01667 """
latitude = [float(_.strip()) for _ in s.split("\n")]

In [3]:
s = """4.899431 821752
5.104480 334176 
4.288788 514861 
-0.22219 9642 
-1.13116 302400 
4.13333 9382 
1.3511 23689 
1.15545 133384 
0.90421 104390 
-0.118092 8787892 
4.47917 623652 
4.70833 70939"""
longitude_pop = [_.split(" ") for _ in s.split("\n")]
longitude = [float(pair[0]) for pair in longitude_pop]
population = [int(pair[1]) for pair in longitude_pop]

In [4]:
import pandas as pd

df = pd.DataFrame({"id": ids, "latitude": latitude, "longitude": longitude, "population": population})
df.head()

          id   latitude  longitude  population
0  Amsterdam  52.379189   4.899431      821752
1    Utrecht  52.092876   5.104480      334176
2   Den Haag  52.078663   4.288788      514861
3  Immingham  53.612390  -0.222190        9642
4  Doncaster  53.522850  -1.131160      302400

In [5]:
df.to_csv("transport-nodes.csv", index=False)

In [6]:
s = """Amsterdam 
Amsterdam
Den Haag 
Amsterdam 
Immingham 
Doncaster
Hoek van Holland 
Felixstowe 
Ipswich 
Colchester 
London
Gouda
Gouda
Den Haag
Hoek van Holland"""

src = [_.strip() for _ in s.split("\n")]

In [7]:
s = """Utrecht
Den Haag 
Rotterdam 
Immingham 
Doncaster 
London
Den Haag
Hoek van Holland 
Felixstowe 
Ipswich 
Colchester 
Rotterdam 
Utrecht
Gouda
Rotterdam"""

dst = [_.strip() for _ in s.split("\n")]
len(src) == len(dst)

True

In [8]:
s = """EROAD 46 EROAD 59 EROAD 26 EROAD 369 EROAD 74 EROAD 277 EROAD 27 EROAD 207 EROAD 22 EROAD 32 EROAD 106 EROAD 25 EROAD 35 EROAD 32 EROAD 33"""
l = s.split(" ")
relationship = l[::2]
cost = list(map(int, l[1::2]))

In [9]:
relationship

['EROAD',
 'EROAD',
 'EROAD',
 'EROAD',
 'EROAD',
 'EROAD',
 'EROAD',
 'EROAD',
 'EROAD',
 'EROAD',
 'EROAD',
 'EROAD',
 'EROAD',
 'EROAD',
 'EROAD']

In [10]:
cost

[46, 59, 26, 369, 74, 277, 27, 207, 22, 32, 106, 25, 35, 32, 33]

In [11]:
df = pd.DataFrame({"src": src, "dst": dst, "relationship": relationship, "cost": cost})
df.head()

         src        dst relationship  cost
0  Amsterdam    Utrecht        EROAD    46
1  Amsterdam   Den Haag        EROAD    59
2   Den Haag  Rotterdam        EROAD    26
3  Amsterdam  Immingham        EROAD   369
4  Immingham  Doncaster        EROAD    74

#### Make it undirected

In [12]:
df2 = pd.DataFrame({"src": dst, "dst": src, "relationship": relationship, "cost": cost})
df2.head()

         src        dst relationship  cost
0    Utrecht  Amsterdam        EROAD    46
1   Den Haag  Amsterdam        EROAD    59
2  Rotterdam   Den Haag        EROAD    26
3  Immingham  Amsterdam        EROAD   369
4  Doncaster  Immingham        EROAD    74

In [13]:
pd.concat([df, df2], axis=0).to_csv("transport-relationships.csv", index=False)